{
  "project": "EauxVid",
  "branchName": "ralph/health-page",
  "description": "Health check page at /health to monitor governmental API availability and tRPC endpoint status",
  "userStories": [
    {
      "id": "US-031",
      "title": "Create health check page route and layout",
      "description": "As a developer, I want a /health route that displays a health check dashboard, not linked from any navigation, accessible only via direct URL.",
      "acceptanceCriteria": [
        "Create `src/app/health/page.tsx` as a client component ('use client')",
        "Page has a heading 'EauxVid — Health Check' and a subtitle explaining it monitors external data sources",
        "Page uses the existing app layout (header/footer) but is NOT linked from header, footer, or any navigation element",
        "Page includes a 'Rafraîchir' (refresh) button that re-runs all health checks when clicked",
        "Page shows a 'Dernière vérification' (last checked) timestamp that updates on each check run",
        "Page is styled consistently with the rest of the app using Tailwind classes",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 1,
      "passes": true,
      "notes": "This is a client component because it needs to make direct fetch calls from the browser to test API reachability from the client side. Import constants (DATA_URLS, ODISSE_API_BASE, CLINICAL_DATASETS) from '@/lib/constants' for the API URLs."
    },
    {
      "id": "US-032",
      "title": "Add SUM'Eau API health checks (direct client-side fetch)",
      "description": "As a developer, I want the health page to directly call the SUM'Eau governmental APIs from the client side and display their status with color coding.",
      "acceptanceCriteria": [
        "Health page calls ALL 4 SUM'Eau endpoints directly from the browser (no tRPC, no server-side proxy): (1) data.gouv.fr indicators CSV, (2) Odissé indicators JSON, (3) data.gouv.fr stations CSV, (4) Odissé stations JSON — use the URLs from DATA_URLS in '@/lib/constants'",
        "Each endpoint is displayed as a card/row with: endpoint name, URL (truncated if long), status indicator, and response time in ms",
        "Status color coding: green circle/badge for HTTP 2xx response, red circle/badge for error/timeout, amber/yellow circle/badge while the request is in-flight (loading)",
        "Each check uses a 10-second timeout via AbortSignal.timeout(10000)",
        "On error, the error message is displayed (e.g., 'Timeout', 'Network Error', HTTP status code)",
        "The fetch calls use `mode: 'cors'` and `method: 'HEAD'` where possible to minimize data transfer — if HEAD fails due to CORS, fall back to a GET with an AbortController that aborts after receiving the first bytes of response",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Some governmental APIs may block HEAD requests or have CORS restrictions. The implementation should handle this gracefully — try HEAD first, if it fails with a CORS or method error, retry with GET. For GET requests on large files (CSV), abort as soon as the response headers are received (we only care about reachability, not the full body). Use `fetch(url, { signal, mode: 'cors' })` and check `response.ok`. data.gouv.fr URLs: DATA_URLS.indicators.primary, DATA_URLS.indicators.fallback, DATA_URLS.stations.primary, DATA_URLS.stations.fallback."
    },
    {
      "id": "US-033",
      "title": "Add Odissé Clinical API health checks (direct client-side fetch)",
      "description": "As a developer, I want the health page to directly call the Odissé Clinical API endpoints from the client side and display their status.",
      "acceptanceCriteria": [
        "Health page calls the Odissé API v2.1 for each of the 3 clinical datasets (flu, bronchiolitis, covid_clinical) directly from the browser",
        "For each disease, make a lightweight request: `${ODISSE_API_BASE}/${datasetId}/records?limit=1` to check if the API responds — use CLINICAL_DATASETS from '@/lib/constants' to get the datasetId for each disease",
        "Each clinical endpoint displayed as a card/row with: disease label (from CLINICAL_DATASETS[id].label), full URL, status indicator, and response time in ms",
        "Same color coding as US-032: green for success, red for error, amber for loading",
        "Each check uses a 10-second timeout",
        "On error, display the error message",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": true,
      "notes": "The Odissé API v2.1 endpoint pattern: `${ODISSE_API_BASE}/${meta.datasetId}/records?limit=1`. Use CLINICAL_DISEASE_IDS to iterate and CLINICAL_DATASETS to get metadata. These are GET requests that return JSON — the `?limit=1` keeps the response tiny."
    },
    {
      "id": "US-034",
      "title": "Add tRPC endpoint health check",
      "description": "As a developer, I want the health page to check whether the tRPC API endpoint is reachable and responding, with the same color-coded status display.",
      "acceptanceCriteria": [
        "Health page makes a direct fetch call to `/api/trpc/wastewater.getStations` (a simple GET query with no input) to verify the tRPC endpoint is alive",
        "Displayed as a separate section titled 'API interne (tRPC)' to distinguish from external governmental APIs",
        "Shows: endpoint name ('tRPC — wastewater.getStations'), status indicator, and response time in ms",
        "Same color coding: green for 2xx, red for error, amber for loading",
        "On error, display the error message or HTTP status",
        "Uses a 10-second timeout",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Call tRPC directly via fetch, NOT via the tRPC client. The URL pattern for a tRPC query with no input is: `/api/trpc/wastewater.getStations`. This tests the full server pipeline (Next.js route handler + tRPC + data service)."
    },
    {
      "id": "US-035",
      "title": "Add overall health summary banner",
      "description": "As a developer, I want a summary banner at the top of the health page that shows the overall system health at a glance.",
      "acceptanceCriteria": [
        "A banner at the top of the health page shows overall status: 'Tous les services sont opérationnels' (green) if ALL checks pass, 'Certains services sont dégradés' (amber) if some fail, 'Services indisponibles' (red) if all fail, 'Vérification en cours...' (amber) while any checks are still loading",
        "The banner has a colored background matching the overall status (green/amber/red tones, consistent with the app's color palette)",
        "Below the banner, a count shows 'X/Y services opérationnels' (e.g., '7/8 services opérationnels')",
        "The banner updates in real-time as individual checks complete",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Total check count: 4 SUM'Eau + 3 Odissé clinical + 1 tRPC = 8 services. The banner should be visually prominent — use a full-width colored bar with appropriate text contrast."
    }
  ]
}
